In [1]:
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
## load data set
data = pd.read_csv('fake_transactional_data_24.csv')
data.head()

,from_totally_fake_account,monopoly_money_amount,to_randomly_generated_account,not_happened_yet_date
0,10371.0,4.00,CINEMA,01/01/2025
1,88339.0,2.40,40544,01/01/2025
2,18555.0,2.40,85149,01/01/2025
3,18555.0,4.10,HIPSTER_COFFEE_SHOP,01/01/2025
4,80792.0,1.95,18555,01/01/2025

In [3]:
data.shape

(10148280, 4)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10148280 entries, 0 to 10148279
Data columns (total 4 columns):
 #   Column                         Dtype
---  ------                         -----
 0   from_totally_fake_account      float64
 1   monopoly_money_amount          float64
 2   to_randomly_generated_account  object
 3   not_happened_yet_date          object
dtypes: float64(2), object(2)
memory usage: 309.7+ MB

In [5]:
data.dtypes

from_totally_fake_account        float64
monopoly_money_amount            float64
to_randomly_generated_account     object
not_happened_yet_date             object
dtype: object

In [6]:
data.columns

Index(['from_totally_fake_account', 'monopoly_money_amount',
       'to_randomly_generated_account', 'not_happened_yet_date'],
      dtype='object')

In [7]:
data.isnull()

,from_totally_fake_account,monopoly_money_amount,to_randomly_generated_account,not_happened_yet_date
0,False,False,False,False
1,False,False,False,False
2,False,False,False,False
3,False,False,False,False
4,False,False,False,False
...,...,...,...,...
10148275,False,False,False,False
10148276,False,False,False,False
10148277,False,False,False,False
10148278,False,False,False,False
10148279,False,False,False,False

In [8]:
missing_values = data.isnull().sum()
print("Missing Values:\n", missing_values)

Missing Values:
 from_totally_fake_account        0
monopoly_money_amount            0
to_randomly_generated_account    0
not_happened_yet_date            0
dtype: int64

In [9]:
data.describe()

       from_totally_fake_account  monopoly_money_amount
count               1.014828e+07           1.014828e+07
mean                5.080502e+04           1.839348e+01
std                 2.893710e+04           8.612323e+01
min                 1.000000e+03           1.450000e+00
25%                 2.530400e+04           2.650000e+00
50%                 5.078100e+04           6.000000e+00
75%                 7.563300e+04           1.200000e+01
max                 1.009880e+05           1.995000e+03

In [10]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
from_totally_fake_account,10148280.0,50805.021701,28937.100678,1000.00,25304.00,50781.0,75633.0,100988.0
monopoly_money_amount,10148280.0,18.393485,86.123232,1.45,2.65,6.0,12.0,1995.0

In [11]:
data.describe(include=['O'])

       to_randomly_generated_account not_happened_yet_date
count                       10148280              10148280
unique                         14300                   364
top                              PUB            12/12/2025
freq                          834380                 52379

In [12]:
data.describe().astype(int)

       from_totally_fake_account  monopoly_money_amount
count                   10148280               10148280
mean                       50805                     18
std                        28937                     86
min                         1000                      1
25%                        25304                      2
50%                        50781                      6
75%                        75633                     12
max                       100988                   1995

In [13]:
data.describe(include='all')

,from_totally_fake_account,monopoly_money_amount,to_randomly_generated_account,not_happened_yet_date
count,1.014828e+07,1.014828e+07,10148280,10148280
unique,NaN,NaN,14300,364
top,NaN,NaN,PUB,12/12/2025
freq,NaN,NaN,834380,52379
mean,5.080502e+04,1.839348e+01,NaN,NaN
std,2.893710e+04,8.612323e+01,NaN,NaN
min,1.000000e+03,1.450000e+00,NaN,NaN
25%,2.530400e+04,2.650000e+00,NaN,NaN
50%,5.078100e+04,6.000000e+00,NaN,NaN
75%,7.563300e+04,1.200000e+01,NaN,NaN
max,1.009880e+05,1.995000e+03,NaN,NaN

In [17]:
## float to integer
data['from_totally_fake_account'] = data['from_totally_fake_account'].astype(int)

In [18]:
# nearest integer/ rounding
data['monopoly_money_amount'] = data['monopoly_money_amount'].round().astype(int)

In [16]:
# Convert the 'not_happened_yet_date' column to datetime
data['not_happened_yet_date'] = pd.to_datetime(data['not_happened_yet_date'], format='%d/%m/%Y')

In [19]:
data.head(3)

,from_totally_fake_account,monopoly_money_amount,to_randomly_generated_account,not_happened_yet_date
0,10371,4,CINEMA,2025-01-01
1,88339,2,40544,2025-01-01
2,18555,2,85149,2025-01-01

In [20]:
data.nunique()

from_totally_fake_account         8142
monopoly_money_amount              915
to_randomly_generated_account    14300
not_happened_yet_date              364
dtype: int64